// Потрібно створити функцію, яка буде приймати ціле число,
// а на виході отримаємо перклік цілих чисел від 1 до заданого числа,
// в якому буде 'foo' замість чисел кратних 3, 'bar' замість чисел кратним 5
// та 'foobar' замість чисел одночасно кратним 3 та 5

const foobar = number => {
    for (let i = 1; i <= number; i += 1) {

        if (i % 3 === 0 && i % 5 === 0) { // умова кратності 3 та 5 одночасно
            console.log('foobar');
        } else if (i % 5 === 0) { // умова кратності 5
            console.log('bar');
        } else if (i % 3 === 0) { // умова кратності 3
            console.log('foo')
        } else {
            console.log(i);
        }
    };
}

foobar(15); // 1, 2, 'foo', 4, 'bar', 'foo', 7, 8, 'foo', 'bar', 11, 'foo', 13, 14, 'foobar'